app/controllers/users_controller.rb

  def role
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 23], ["LIMIT", 1]]

  def create_user_type
    user = User.find(user_type_reset_params[:id])
    user.user_type = user_type_reset_params[:user_type]
    user.save!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "users" SET "user_type" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_type", "admin123"], ["updated_at", 2016-09-08 18:25:22 UTC], ["id", 23]]